src/src/AccumulationRegisters/VATInput.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>VATInput</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>AmountExcludesVAT</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>VATAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>OperationType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.VATOperationTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ProductType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ProductsTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Supplier</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ShipmentDocument</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.CustomsDeclaration</v8:Type>
						<v8:Type>cfg:DocumentRef.PaymentExpense</v8:Type>
						<v8:Type>cfg:DocumentRef.DebitNote</v8:Type>
						<v8:Type>cfg:DocumentRef.CashVoucher</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>VATRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/src/Enums/VATOperationTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>VATOperationTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AdvancePayment</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AdvanceCleared</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Sales</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SalesReturn</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DiscountAllowed</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Export</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Purchases</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PurchasesReturn</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DiscountReceived</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Import</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReverseChargeApplied</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherAdjustments</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/AccumulationRegisters/VATInput/Ext/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region InfobaseUpdate

Procedure ProcessDataToUpgradeToNewVersion() Export
	
	Query = New Query;
	Query.Text = 
	"SELECT DISTINCT
	|	VATInput.Recorder AS Recorder
	|FROM
	|	AccumulationRegister.VATInput AS VATInput
	|WHERE
	|	VATInput.OperationType = VALUE(Enum.VATOperationTypes.EmptyRef)
	|
	|UNION ALL
	|
	|SELECT
	|	TaxInvoiceReceived.Ref
	|FROM
	|	Document.TaxInvoiceReceived AS TaxInvoiceReceived
	|		LEFT JOIN AccumulationRegister.VATInput AS VATInput
	|		ON TaxInvoiceReceived.Ref = VATInput.Recorder
	|			AND (VATInput.LineNumber = 1)
	|WHERE
	|	TaxInvoiceReceived.Posted
	|	AND VATInput.Recorder IS NULL";
	
	Selection = Query.Execute().Select();
	
	While Selection.Next() Do
		
		DocType = TypeOf(Selection.Recorder);
		If DocType = Type("DocumentRef.RegistersCorrection") Then
			Continue;
		EndIf;
		
		BeginTransaction();
		
		DocObject = Selection.Recorder.GetObject();
		
		DriveServer.InitializeAdditionalPropertiesForPosting(DocObject.Ref, DocObject.AdditionalProperties);
		
		Documents[DocObject.Metadata().Name].InitializeDocumentData(DocObject.Ref, DocObject.AdditionalProperties);
		
		If DocObject.AdditionalProperties.TableForRegisterRecords.Property("TableVATInput")
			And DocObject.AdditionalProperties.TableForRegisterRecords.TableVATInput.Count() Then
			
			DriveServer.ReflectVATInput(DocObject.AdditionalProperties, DocObject.RegisterRecords, False);
			
		Else
			
			DocObject.RegisterRecords.VATInput.Clear();
			DocObject.RegisterRecords.VATInput.Write = True;
			
		EndIf;
		
		DriveServer.WriteRecordSets(DocObject.ThisObject);
		
		DocObject.AdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager.Close();
		
		CommitTransaction();
		
	EndDo;
	
EndProcedure

#EndRegion

#EndIf
